### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-16T22:21:51.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:31",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:27" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:27/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip" -> "lambda-builds/5937bc4fbe99b7e1c1b803bd9c344c113d7d412310bc0a9bf97079a0766169f2.zip"
!       s3_object_version              = "8FIpaKkiTVGj1xydbizdzB1Nq2FFSxMG" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "27" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "27" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "6a4136f891d5c3b26f402d2f3c39f020" -> (known after apply)
!       id                     = "lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip" -> (known after apply)
!       key                    = "lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip" -> "lambda-builds/5937bc4fbe99b7e1c1b803bd9c344c113d7d412310bc0a9bf97079a0766169f2.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip" -> "./.terraform/lambda-builds/5937bc4fbe99b7e1c1b803bd9c344c113d7d412310bc0a9bf97079a0766169f2.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "8FIpaKkiTVGj1xydbizdzB1Nq2FFSxMG" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "src/.*",
                        ],
                    ],
+                   [
+                       "zip",
+                       ".",
+                       "src",
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/5937bc4fbe99b7e1c1b803bd9c344c113d7d412310bc0a9bf97079a0766169f2.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/5937bc4fbe99b7e1c1b803bd9c344c113d7d412310bc0a9bf97079a0766169f2.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2866290589750427388" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip" -> "./.terraform/lambda-builds/5937bc4fbe99b7e1c1b803bd9c344c113d7d412310bc0a9bf97079a0766169f2.zip"
!           "timestamp" = "1692224435383558000" -> "1692229383402599000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "88749772837520399" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/19980c9f3a62e3228a25ecb366d0d022c7c18bfa34f8f4491464ff03727c979e.zip" -> "./.terraform/lambda-builds/5937bc4fbe99b7e1c1b803bd9c344c113d7d412310bc0a9bf97079a0766169f2.zip"
!           "original_source_code" = jsonencode(
!               [
!                   {
!                       path          = "./src" -> "."
!                       patterns      = <<-EOT
-                           !src/.*
+                           src/.*
                        EOT
+                       prefix_in_zip = "src"
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:31" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-16T22:21:35.489+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:31" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/a71b09ddf6bbcea41a40d39d4c1a4b2e6583c49adb8cb15e3f49eccf1b70f879.zip" -> "builds/23a28a3cb0d8b87ebb6a4c5e6eb13a5f50e5abd356db030d38ee2255eabe3fc9.zip"
!       s3_object_version           = "9BlGOLqyZu.qusGqCHoe0KAhXzN5p4.9" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "QzZAtvgHPLBfqVoDiVe1J0pZ3Hr+VWz7Z2z1axVXJBI=" -> (known after apply)
!       source_code_size            = 29718225 -> (known after apply)
!       version                     = "31" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "205b43de2b7381f0d48724cdb0bdf062-6" -> (known after apply)
!       id                     = "builds/a71b09ddf6bbcea41a40d39d4c1a4b2e6583c49adb8cb15e3f49eccf1b70f879.zip" -> (known after apply)
!       key                    = "builds/a71b09ddf6bbcea41a40d39d4c1a4b2e6583c49adb8cb15e3f49eccf1b70f879.zip" -> "builds/23a28a3cb0d8b87ebb6a4c5e6eb13a5f50e5abd356db030d38ee2255eabe3fc9.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/a71b09ddf6bbcea41a40d39d4c1a4b2e6583c49adb8cb15e3f49eccf1b70f879.zip" -> "builds/23a28a3cb0d8b87ebb6a4c5e6eb13a5f50e5abd356db030d38ee2255eabe3fc9.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "9BlGOLqyZu.qusGqCHoe0KAhXzN5p4.9" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/23a28a3cb0d8b87ebb6a4c5e6eb13a5f50e5abd356db030d38ee2255eabe3fc9.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/23a28a3cb0d8b87ebb6a4c5e6eb13a5f50e5abd356db030d38ee2255eabe3fc9.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "6841579512417492042" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/a71b09ddf6bbcea41a40d39d4c1a4b2e6583c49adb8cb15e3f49eccf1b70f879.zip" -> "builds/23a28a3cb0d8b87ebb6a4c5e6eb13a5f50e5abd356db030d38ee2255eabe3fc9.zip"
!           "timestamp" = "1692224437098037000" -> "1692229366182749000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "5311609634391794698" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/a71b09ddf6bbcea41a40d39d4c1a4b2e6583c49adb8cb15e3f49eccf1b70f879.zip" -> "builds/23a28a3cb0d8b87ebb6a4c5e6eb13a5f50e5abd356db030d38ee2255eabe3fc9.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>